In [15]:
# pip install mysql-connector-python
import mysql.connector

# Creating connection object
mydb_conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password ="Ahmed12345",
    port=3306,
    database='library'
)

# Printing the connection object 
print(mydb_conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000234E5E56350>

In [16]:
cursor = mydb_conn.cursor()
cursor

In [19]:
#find the number of availalbe copies of the book (Dracula) 
cursor.execute("""SELECT (SELECT COUNT(*) FROM Books WHERE Title = 'Dracula') -
(SELECT COUNT(*) FROM Loans as l inner join books as b on b.BookID=l.BookID
where  b.Title = 'Dracula' AND ReturnedDate IS NULL) as available_copies;""")
result = cursor.fetchall()
result

[(2,)]

In [ ]:
# Add new books to the library
cursor.execute("""insert into books values(201,"old man","wiliam",1977,1234567890);""")
result = cursor.fetchall()
result

In [ ]:
#Check out Books: books(4043822646, 2855934983) whose patron_email(jvaan@wisdompets.com), loandate=2020-08-25, duedate=2020-09-08, loanid=by_your_choice
cursor.execute("""insert into loans (LoanID, BookID, PatronID, LoanDate, DueDate, ReturnedDate) values
(3001,(select bookid from books where Barcode=4043822646),
(select PatronID from patrons where email="jvaan@wisdompets.com"),"2020-08-25","2020-09-08",null),
(3002,(select bookid from books where Barcode=2855934983),
(select PatronID from patrons where email="jvaan@wisdompets.com"),"2020-08-25","2020-09-08",null);""")
result = cursor.fetchall()
result

In [23]:
#/* Check books for Due back                            
#/* generate a report of books due back on July 13, 2020 */
#/* with patron contact information                      */
cursor.execute("""select *from books as b 
inner join loans as l on b.BookID=l.BookID
inner join patrons as p on p.PatronID=l.PatronID 
where DueDate="2020-07-13" ;""")
result = cursor.fetchall()
result

[(10,
  'The Count of Monte Cristo',
  'Alexandre Dumas',
  1884,
  1799238621,
  1996,
  10,
  99,
  '2020-06-29',
  '2020-07-13',
  None,
  'Kala',
  'Simonian',
  'ksimonian2q@landonhotel.com',
  99),
 (155,
  'The Prophet',
  'Kahlil Gibran',
  1923,
  9013040583,
  1997,
  155,
  47,
  '2020-06-29',
  '2020-07-13',
  None,
  'Lydie',
  'Awmack',
  'lawmack1a@samoca.org',
  47),
 (169,
  'Second Treatise of Government',
  'John Locke',
  1689,
  5647388501,
  1998,
  169,
  18,
  '2020-06-29',
  '2020-07-13',
  None,
  'Anthe',
  'Dinjes',
  'adinjesh@samoca.org',
  18),
 (73,
  'Dracula',
  'Bram Stoker',
  1897,
  8730298424,
  1999,
  73,
  59,
  '2020-06-29',
  '2020-07-13',
  None,
  'Cornelia',
  'Koppe',
  'ckoppe1m@landonhotel.com',
  59)]

In [24]:
#/* Return books to the library (which have barcode=6435968624) and return this book at this date(2020-07-05)*/
cursor.execute("""UPDATE Loans SET ReturnedDate = '2020-07-05' 
WHERE BookID = (SELECT BookID FROM Books WHERE Barcode = 6435968624) 
AND ReturnedDate IS NULL;""")
result = cursor.fetchall()
result

[]

In [25]:
#/* Encourage Patrons to check out books                */
#/* generate a report of showing 10 patrons who have
#checked out the fewest books.                          */

cursor.execute("""select p.PatronID ,p.FirstName,count(l.LoanID) as count_of_books_cheked_out from patrons as p
inner join loans AS l on p.PatronID=l.BookID
group by p.PatronID ,p.FirstName
order by count_of_books_cheked_out asc 
limit 4;""")
result = cursor.fetchall()
result

[(66, 'Gilbert', 3),
 (57, 'Kahaleel', 4),
 (32, 'Demetri', 4),
 (53, 'Perceval', 4)]

In [26]:
#/* Find books to feature for an event                  
#create a list of books from 1890s that are
#currently available   */
cursor.execute("""select b.bookid,b.title,b.Published from books as b 
 inner join loans as l on l.BookID=b.BookID 
 where  b.Published >=1890 and l.ReturnedDate is null
 order by b.Published asc;""")
result = cursor.fetchall()
result

[(154, 'An Occurrence at Owl Creek Bridge', 1890),
 (91,
  'The Importance of Being Earnest: A Trivial Comedy for Serious People',
  1895),
 (95, 'Also sprach Zarathustra', 1896),
 (73, 'Dracula', 1897),
 (119, 'The Tale of Peter Rabbit', 1901),
 (130, 'Peter Pan', 1911),
 (155, 'The Prophet', 1923)]

In [27]:
#/* Book Statistics 
#/* create a report to show how many books were 
#published each year.  
cursor.execute("""SELECT Published, COUNT(DISTINCT(Title)) AS TotalNumberOfPublishedBooks FROM Books
GROUP BY Published
ORDER BY TotalNumberOfPublishedBooks DESC; """)
result = cursor.fetchall()
result

[(1890, 3),
 (1895, 3),
 (1847, 2),
 (1869, 2),
 (1850, 2),
 (1892, 2),
 (1859, 2),
 (1884, 2),
 (1898, 2),
 (1899, 2),
 (1911, 2),
 (1922, 2),
 (1811, 1),
 (1813, 1),
 (1815, 1),
 (1818, 1),
 (1839, 1),
 (1759, 1),
 (1849, 1),
 (1851, 1),
 (1852, 1),
 (1854, 1),
 (1858, 1),
 (1861, 1),
 (1865, 1),
 (1876, 1),
 (1878, 1),
 (1879, 1),
 (1375, 1),
 (1883, 1),
 (1532, 1),
 (1886, 1),
 (1887, 1),
 (1889, 1),
 (1605, 1),
 (1880, 1),
 (1894, 1),
 (1670, 1),
 (1896, 1),
 (1897, 1),
 (1689, 1),
 (1726, 1),
 (1900, 1),
 (1901, 1),
 (1902, 1),
 (1905, 1),
 (1906, 1),
 (1908, 1),
 (1729, 1),
 (1913, 1),
 (1914, 1),
 (1915, 1),
 (1920, 1),
 (1921, 1),
 (1791, 1),
 (1923, 1),
 (1977, 1)]

In [28]:
#/* Book Statistics                                           */
#/* create a report to show 5 most popular Books to check out */
cursor.execute("""SELECT b.Title, b.Author, b.Published, COUNT(b.Title) AS TotalTimesOfLoans FROM Books b
JOIN Loans l ON b.BookID = l.BookID
GROUP BY b.Title, b.Author, b.Published
ORDER BY 4 DESC
LIMIT 5;""")
result = cursor.fetchall()
result

[('Frankenstein; Or, The Modern Prometheus',
  'Mary Wollstonecraft Shelley',
  1818,
  53),
 ('The Awakening, and Selected Short Stories', 'Kate Chopin', 1899, 43),
 ('The War of the Worlds', 'H. G. Wells', 1898, 43),
 ('The Scarlet Letter', 'Nathaniel Hawthorne', 1850, 42),
 ('The Picture of Dorian Gray', 'Oscar Wilde', 1890, 41)]